{
  "roles": [
    "Рассказчик",
    "Винни Пух",
    "Пятачок"
  ],
  "dialog": [
    {
      "role": "Рассказчик",
      "text": "Давным-давно... Кажется, в прошлую пятницу жил в одной стране медвежонок под именем Винни Пух. А почему под именем? Потому что над его дверью была надпись: 'Винни Пух', а он под нею жил. Однажды Винни Пух отправился в лес, чтобы немного подкрепиться. Он всегда был не прочь подкрепиться. Кроме того, он был поэт и в свободное время сочинял стихи.. .. и даже песенки. Приблизительно такие:"
    },
    {
      "role": "Винни Пух",
      "text": "Трам-парам-пурум... в затылке пум-пурум-парам.... вопилки Пум-пу.. Пум-пу.... Если я чешу в затылке - не бе-да! В голове моей опилки - да-да-да! Но, хотя там и опилки, но кричалки и вопилки... А также шумилки, пастилки, сопилки... Сочиняю я неплохо иногда - да! Харашо живет на свете Вин-ни Пух! Оттого поёт он эти песни вслух! И неважно, чем он занят, если он худеть не станет, а ведь он худеть не станет... ...если, конечно, ему вовремя подекрепиться... ДА! Трам-парам-пам, пам-парам-пам Трам-пам-па! Трум-пурум-пум, пум-пурум-пум Трам-пам-па! Прм-пуру-пум..... Пум-пурум-пум.... пум-пурум-пум... пум"
    },
    {
      "role": "Винни Пух",
      "text": "Это 'Ж-ж-ж' неспроста. Само дерево жужжать не может. Значит, кто-то тут жужжит. А зачем тебе жужжать, если ты - не пчела? По-моему, так. А зачем на свете пчёлы? Для того, чтобы делать мёд. По-моему, так. А зачем на свете мёд? Для того, чтобы я его ел. По-моему, так. Если б мишки были пчёлами, то они бы нипочём.. никогда и не подумали так высОко строить дом. ОЙ! Мишка очень любит мёд. Ой! Почему - кто поймет? В самом деле, почему мёд так нравится ему? Ой, ма..!"
    },
    {
      "role": "Рассказчик",
      "text": "Итак, Винни Пух отправился к своему лучшему другу поросёнку Пятачку, который жил в домике с надписью 'Посторонним В'. А кто такой был Посторонним В. - об этом не знал даже сам Пятачок."
    },
    {
      "role": "Пятачок",
      "text": "Доброе утро, Винни Пух!"
    },
    {
      "role": "Винни Пух",
      "text": "Доброе утро, Пятачок. Интересно, нет ли у тебя случайно воздушного шара?"
    },
    {
      "role": "Пятачок",
      "text": "Воздушного шара?"
    },
    {
      "role": "Винни Пух",
      "text": "Да. Я как раз шел мимо и думал: 'нет ли у Пятачка случайно воздушного шара'."
    },
    {
      "role": "Пятачок",
      "text": "А зачем тебе воздушный шар?"
    },
    {
      "role": "Винни Пух",
      "text": "МЁД"
    },
    {
      "role": "Пятачок",
      "text": "Что?"
    },
    {
      "role": "Винни Пух",
      "text": "Мёд."
    },
    {
      "role": "Пятачок",
      "text": "Кто же это ходит за мёдом с воздушными шариками?"
    },
    {
      "role": "Винни Пух",
      "text": "Я хожу."
    },
    {
      "role": "Рассказчик",
      "text": "А как раз накануне Пятачок был в гостях у Кролика, и там ему подарили два прекрасных шарика - синий и зеленый."
    },
    {
      "role": "Пятачок",
      "text": "Какой тебе больше нравится?"
    },
    {
      "role": "Винни Пух",
      "text": "Вот что. Когда идешь за мёдом, главное, чтобы пчёлы тебя не заметили."
    },
    {
      "role": "Пятачок",
      "text": "Ага."
    },
    {
      "role": "Винни Пух",
      "text": "Если шар будет зеленый, они могут подумать, что это листик, и не заметят его."
    },
    {
      "role": "Пятачок",
      "text": "Ага."
    },
    {
      "role": "Винни Пух",
      "text": "А если шар будет синий, они подумают, что это просто кусочек неба, и тоже ничего не заметят."
    },
    {
      "role": "Пятачок",
      "text": "Как ты думаешь, они не заметят под шариком - тебя?"
    },
    {
      "role": "Винни Пух",
      "text": "Может заметят, а может и нет. о, я притворюсь, будто я маленькая тучка. Тогда они не догадаются."
    },
    {
      "role": "Пятачок",
      "text": "Ага. Тогда тебе лучше взять синий шар."
    },
    {
      "role": "Винни Пух",
      "text": "Куда идем мы с Пятачком- большой-большой секрет! И не расскажем мы о нём, о, нет и нет... И!"
    },
    {
      "role": "Пятачок",
      "text": "Да! У тебя есть зонтик?"
    },
    {
      "role": "Винни Пух",
      "text": "Зонтик?"
    },
    {
      "role": "Винни Пух",
      "text": "Видишь ли, я как раз подумал, а не захватить ли нам на всякий случай зонтик. От этих пчёл всего можно ожидать."
    },
    {
      "role": "Пятачок",
      "text": "Ага! Куда идем мы с Пятачком - большой-большой секрет! И не расскажем мы о нём - о, нет и нет... И!"
    },
    {
      "role": "Винни Пух",
      "text": "Да. Подержи. Ну вот. Теперь я совсем как настоящая чёрная тучка. Куда идем мы с Пятачком - большой-большой секрет! И не расскажем мы о нём - о, нет и нет... И!"
    },
    {
      "role": "Винни Пух",
      "text": "Да?"
    },
    {
      "role": "Пятачок",
      "text": "Нет. Надувай шарик."
    },
    {
      "role": "Винни Пух",
      "text": "Ага."
    },
    {
      "role": "Пятачок",
      "text": "Ага. Отпускай. Ура-а-а!"
    },
    {
      "role": "Винни Пух",
      "text": "Что, здорово? Ну, на кого я теперь похож?"
    },
    {
      "role": "Пятачок",
      "text": "На медведя, который летит на воздушном шаре."
    },
    {
      "role": "Винни Пух",
      "text": "А на маленькую тучку разве не похож?"
    },
    {
      "role": "Пятачок",
      "text": "Нет, не очень!"
    },
    {
      "role": "Винни Пух",
      "text": "Ладно. Может, отсюда больше похож. Разве знаешь, что придёт в голову этим пчёлам?"
    },
    {
      "role": "Винни Пух",
      "text": "Пятачок!"
    },
    {
      "role": "Пятачок",
      "text": "Что?"
    },
    {
      "role": "Винни Пух",
      "text": "По-моему, пчёлы что-то подозревают."
    },
    {
      "role": "Пятачок",
      "text": "Что подозревают?"
    },
    {
      "role": "Винни Пух",
      "text": "Не знаю, но только они ведут себя подозрительно."
    },
    {
      "role": "Пятачок",
      "text": "Может, они думают, что ты хочешь утащить у них мёд?"
    },
    {
      "role": "Винни Пух",
      "text": "Пятачок! Кажется, они не верят, что я чёрная тучка."
    },
    {
      "role": "Пятачок",
      "text": "А что делать?"
    },
    {
      "role": "Винни Пух",
      "text": "Открывай зонтик и ходит взад-вперёд. Я буду петь тучкину песню, а ты смотри на меня и говори: 'Кажется, дождь собирается..'"
    },
    {
      "role": "Пятачок",
      "text": "Ага. Кажется, дождь собирается... Кажется, дождь собирается. Кажется, дождь собирается."
    },
    {
      "role": "Винни Пух",
      "text": "Я тучка, тучка, тучка, я вовсе не медведь. Ах, как приятно тучке по небу лететь! Ай, Пятачок!"
    },
    {
      "role": "Пятачок",
      "text": "Кажется, дождь соибра... Что?"
    },
    {
      "role": "Винни Пух",
      "text": "Я думал-думал, я всё понял! Оказывается, это неправильные пчёлы. Совсем неправильные. И они, наверное, делают неправильный мёд. Я... Я вниз спускаюсь."
    },
    {
      "role": "Пятачок",
      "text": "Кажется, дождь собир... А как?"
    },
    {
      "role": "Винни Пух",
      "text": "Об этом я еще не подумал..."
    },
    {
      "role": "Пятачок",
      "text": "Кажется, дождь собирается..."
    },
    {
      "role": "Винни Пух",
      "text": "Пятачок!"
    },
    {
      "role": "Пятачок",
      "text": "Что?"
    },
    {
      "role": "Винни Пух",
      "text": "У тебя есть дома ружьё?"
    },
    {
      "role": "Пятачок",
      "text": "Есть."
    },
    {
      "role": "Винни Пух",
      "text": "Неси его скорей!"
    },
    {
      "role": "Пятачок",
      "text": "Ага."
    },
    {
      "role": "Винни Пух",
      "text": "А в синем-синем небе Порядок и уют... Поэтому все тучки Так весело поют... АЙ, Пятачок!"
    },
    {
      "role": "Пятачок",
      "text": "Я зде-е-есь!"
    },
    {
      "role": "Винни Пух",
      "text": "Стреляй!"
    },
    {
      "role": "Пятачок",
      "text": "Куда ж ты стреляешь?"
    },
    {
      "role": "Винни Пух",
      "text": "В пчёл, конечно."
    },
    {
      "role": "Пятачок",
      "text": "Да не в пчёл! Ты должен сбить шар."
    },
    {
      "role": "Винни Пух",
      "text": "Но... Если я выстрелю, шарик... он же испортится..."
    },
    {
      "role": "Пятачок",
      "text": "А если ты не выстрелишь, тогда испорчусь я!"
    },
    {
      "role": "Винни Пух",
      "text": "Ага. Ой-ёй-ёй! У!"
    },
    {
      "role": "Пятачок",
      "text": "Разве не попал?"
    },
    {
      "role": "Винни Пух",
      "text": "Уй.. Не то, чтобы совсем не попал. Но только не попал в шарик. Прости, пожалуйста."
    },
    {
      "role": "Пятачок",
      "text": "Винни! Винни! Винни!"
    },
    {
      "role": "Винни Пух",
      "text": "Ух... Пух... Фух..."
    },
    {
      "role": "Рассказчик",
      "text": "Может быть, именно по этому, хотя и нельзя сказать наверняка, его и назвали Винни Пух. А не пора ли нам подкрепиться? По-моему, пора! Ну что ж, сказке - конец. То есть, конец этой сказке. А есть и другие: про Пуха и Кролика, про Пятачка и старого серго Ослика. И про всех остальных :)"
    }
  ]
}